
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖

<details><summary>Show Plan</summary>

```
tofu
data.aws_secretsmanager_secret_version.creds: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
data.aws_secretsmanager_secret_version.dev_creds: Reading...
data.aws_vpc.selected: Reading...
module.scheduler_dev.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-scheduler-dev]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-service]
module.ecs_dev.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-service-dev]
module.scheduler.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-scheduler]
module.qdrant.aws_efs_file_system.qdrant: Refreshing state... [id=fs-04611310d7d2b8293]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=ecr-mediamind]
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Reading...
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.ecs_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.ecs_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.redis.aws_elasticache_cluster.redis: Refreshing state... [id=mediamind-redis]
data.aws_secretsmanager_secret_version.dev_creds: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/dev-env-mjm2wi|AWSCURRENT]
module.scheduler.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.scheduler.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:cluster/mediamind-cluster]
data.aws_secretsmanager_secret_version.creds: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/app-env-fUauFQ|AWSCURRENT]
module.ecs_dev.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:cluster/mediamind-cluster]
module.ecr_scheduler.aws_ecr_repository.ecr: Refreshing state... [id=ecr-mediamind-scheduler]
module.s3.aws_s3_bucket.backend: Refreshing state... [id=eutop-mediamind]
module.scheduler_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.qdrant.aws_cloudwatch_log_group.qdrant: Refreshing state... [id=/ecs/mediamind-qdrant]
module.scheduler_dev.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-service-ecs-task-execution]
module.qdrant.aws_iam_role.qdrant_task_execution_role: Refreshing state... [id=mediamind-qdrant-task-execution]
module.ecs_dev.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-service-dev-ecs-task-execution]
module.scheduler.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-scheduler-ecs-task-execution]
module.scheduler_dev.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-scheduler-dev-ecs-task-execution]
module.qdrant.aws_iam_role_policy_attachment.qdrant_task_execution_role_policy: Refreshing state... [id=mediamind-qdrant-task-execution-20250529181739908900000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-service-ecs-task-execution-20250529150109931500000002]
module.ecs.aws_iam_role_policy.ecs_secrets: Refreshing state... [id=mediamind-service-ecs-task-execution:mediamind-service-secrets]
module.qdrant.aws_ecs_task_definition.qdrant: Refreshing state... [id=mediamind-qdrant]
module.database.aws_db_instance.postgres: Refreshing state... [id=db-JTOTX5CRVLOAA47F5LJFTYSYJA]
module.scheduler.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-scheduler-ecs-task-execution-20250716012724546000000002]
module.ecs_dev.aws_iam_role_policy.ecs_secrets: Refreshing state... [id=mediamind-service-dev-ecs-task-execution:mediamind-service-dev-secrets]
module.ecs_dev.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-service-dev-ecs-task-execution-20250619150554273500000002]
module.scheduler_dev.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-scheduler-dev-ecs-task-execution-20250716010927580200000001]
module.scheduler.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-scheduler]
module.scheduler_dev.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-scheduler-dev]
data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.ecs.data.aws_vpc.selected: Reading...
module.ecs_dev.data.aws_vpc.selected: Reading...
module.alb.aws_lb_target_group.prod: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-prod-tg/2ef77808e9f6efcf]
module.alb.aws_lb_target_group.dev: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-dev-tg/fc7b4c7d8735e7e2]
module.alb.aws_lb_target_group.qdrant: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-qdrant-tg/3a589dcfeb8c0dc1]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0ca55e65142f73283]
data.aws_subnets.selected: Reading...
data.aws_subnets.selected: Read complete after 0s [id=eu-central-1]
module.scheduler_dev.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-scheduler-dev]
module.scheduler.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-scheduler]
module.alb.aws_lb.shared: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-shared-alb/8f0bd898ec9e9899]
module.ecs_dev.aws_security_group.ecs_service: Refreshing state... [id=sg-085a3500157b26cd4]
module.qdrant.aws_security_group.qdrant: Refreshing state... [id=sg-0f4f72368e2d52623]
module.ecs.aws_security_group.ecs_service: Refreshing state... [id=sg-0cd43e1101e5aa36f]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0d990bb33ae872102"]: Refreshing state... [id=fsmt-0c39849845d78983d]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0f691c9f6c562fab6"]: Refreshing state... [id=fsmt-06b0ba38a3120241e]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0910d308a8661b1da"]: Refreshing state... [id=fsmt-0e0a3662e8daddc56]
module.qdrant.aws_ecs_service.qdrant: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-qdrant]
module.ecs.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.ecs_dev.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-shared-alb/8f0bd898ec9e9899/e09f7359667f4dcd]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445]
module.ecs_dev.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-service-dev]
module.ecs.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-service]
module.ecs_dev.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service-dev]
module.ecs.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service]
module.alb.aws_lb_listener_certificate.dev: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445_arn:aws:acm:eu-central-1:313193269185:certificate/3f5b9917-f56f-414a-ab56-b751c55733ee]
module.alb.aws_lb_listener_certificate.qdrant: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445_arn:aws:acm:eu-central-1:313193269185:certificate/3f5b9917-f56f-414a-ab56-b751c55733ee]
module.alb.aws_lb_listener_rule.qdrant: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener-rule/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445/873e2bfd59ac39d6]
module.alb.aws_lb_listener_rule.dev: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener-rule/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445/44c9497fc1f6664b]
module.alb.aws_lb_listener_rule.prod: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener-rule/app/mediamind-shared-alb/8f0bd898ec9e9899/fce8c595bc0f1445/cc7eadcfbd27778c]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # module.scheduler.aws_ecs_service.app will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-scheduler"
        name                               = "mediamind-scheduler"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-scheduler:3" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.scheduler.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-scheduler:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-scheduler" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "mediamind-scheduler" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.scheduler_dev.aws_ecs_service.app will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-scheduler-dev"
        name                               = "mediamind-scheduler-dev"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-scheduler-dev:5" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.scheduler_dev.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-scheduler-dev:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-scheduler-dev" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "mediamind-scheduler-dev" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>
